// =============================================================================
// Дочерний компонент
// =============================================================================

// 1. Импортировать зависимости
// 1.1. Хук работы с контекстом
import useDataContext from "../hooks/useDataContext.js";


// 2. Компонент
const Child = () => {
  // 2.1. Получить данные из контекста
  const { name, age } = useDataContext();
  
  // 2.2. Использовать данные из контекста
  return (<>
    <h1>Данные из контекста</h1>
    <p>Имя: {name}</p>
    <p>Возраст: {age}</p>
  </>)
}

export default Child;