// =============================================================================
// ДОЧЕРНИЙ КОМПОНЕНТ
// =============================================================================

// 1. Импортировать зависимости
// 1.1. Контекст
import { AuthContext } from "./index.js";
// 1.2. Хук получения данных из контекста
import { useContext } from "react";


// 2. Создать компонент
const App = () => {
  // 2.1. Получить данные из контекста
  const context = useContext(AuthContext);
  
  // 2.2. Использовать данные из контекста
  return (<>
    <p>Авторизованность пользователя: {`${context.isAuth}`}</p>
  </>)
}

export default App;