// =============================================================================
// Дочерний компонент
// =============================================================================

// 1. Импортировать зависимости
// 1.1. Контекст
import { DataContext } from "../contexts/DataContext.js";
// 1.2. Хук получения данных из контекста
import { useContext } from "react";


// 2. Компонент
const Child = () => {
  // 2.1. Получить данные из контекста
  const context = useContext(DataContext);
  
  // 2.2. Использовать данные из контекста
  return (<>
    <h1>Данные из контекста</h1>
    <p>Имя: {context.name}</p>
    <p>Возраст: {context.age}</p>
  </>)
}

export default Child;