// ========================================================================
// Основной компонент приложения
// ========================================================================

// 1. Импортировать зависимости
// 1.1. Компонент-провайдер контекста
import { AuthProvider } from "./contexts/AuthContext.js";
// 1.2. Дочерний компонент
import Child from "./components/Child.js";


// 2. Добавить самым верхним компонент-провайдер контекста "AuthProvider"
const App = () => {
  return (<>
    <AuthProvider>
      <Child/>
    </AuthProvider>
  </>)
}

export default App;